# 2024-2 언어데이터과학 7강 (2024-09-26) 데이터프레임과 `pandas` 패키지


## 데이터프레임(data frame)

열 방향으로 각 변수가, 행 방향으로 각 관측치가 기록된 데이터 구조

### [예시] 배열

||국어|수학|
|-|-|-|
|3월|90|74|
|4월|95|70|
|5월|89|81|

행 방향으로 월이라는 변수가, 열 방향으로 과목이라는 변수가 기록되어 있다.

### [예시] 데이터프레임

|월|과목|점수|
|-|-|-|
|3월|국어|90|
|3월|수학|74|
|4월|국어|95|
|4월|수학|70|
|5월|국어|89|
|5월|수학|81|

데이터프레임에서는 행 하나가 하나의 관측치를 담고 있어야 한다.

## 배열

 ![score-table.png]()

In [1]:
import numpy as np
scores = np.array(
    [[[80, 75, 90],
      [84, 81, 93],
      [89, 72, 98],
      [88, 85, 97]],

     [[91, 83, 79],
      [84, 99, 82],
      [92, 90, 85],
      [93, 92, 80]]]
)

### 데이터프레임 자료형을 만드는 첫 번째 방법

1. 관측 한 개를 이루는 변수들의 값을 튜플로 나타낸다.
2. 여러 관측들을 하나의 리스트로 묶는다.

In [2]:
axis0 = ['강은수', '조재영'] # 학생
axis1 = ['3월', '4월', '5월', '6월'] # 월
axis2 = ['국어', '영어', '수학'] # 과목

exam = []
# DO SOMETHING HERE

```
exam

[('강은수', '3월', '국어', 80),
 ('강은수', '3월', '영어', 75),
 ('강은수', '3월', '수학', 90),
 ('강은수', '4월', '국어', 84),
 ('강은수', '4월', '영어', 81),
 ('강은수', '4월', '수학', 93),
 ('강은수', '5월', '국어', 89),
 ('강은수', '5월', '영어', 72),
 ('강은수', '5월', '수학', 98),
 ('강은수', '6월', '국어', 88),
 ('강은수', '6월', '영어', 85),
 ('강은수', '6월', '수학', 97),
 ('조재영', '3월', '국어', 91),
 ('조재영', '3월', '영어', 83),
 ('조재영', '3월', '수학', 79),
 ('조재영', '4월', '국어', 84),
 ('조재영', '4월', '영어', 99),
 ('조재영', '4월', '수학', 82),
 ('조재영', '5월', '국어', 92),
 ('조재영', '5월', '영어', 90),
 ('조재영', '5월', '수학', 85),
 ('조재영', '6월', '국어', 93),
 ('조재영', '6월', '영어', 92),
 ('조재영', '6월', '수학', 80)]
```

데이터프레임을 본격적으로 다루는 라이브러리로 `pandas`가 있다.

`openpyxl`을 함께 설치하면 엑셀 파일도 처리할 수 있다.

In [4]:
%pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\t\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: openpyxl in c:\users\t\anaconda3\lib\site-packages (3.1.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\t\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\t\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\t\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\t\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: et-xmlfile in c:\users\t\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: six>=1.5 in c:\users\t\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

`pandas` 라이브러리는 일반적으로 `pd` 두 글자로 줄여서 가져온다.

In [5]:
import pandas as pd

데이터프레임은 `pandas` 라이브러리에서 `DataFrame` 자료형의 객체로 처리된다.

구조가 같은 튜플로 이루어진 리스트를 `pd.DataFrame()`으로 형변환할 수 있다.

In [6]:
df_exam = pd.DataFrame(exam, columns=['학생', '월', '과목', '점수'])
df_exam

     학생   월  과목  점수
0   강은수  3월  국어  80
1   강은수  3월  영어  75
2   강은수  3월  수학  90
3   강은수  4월  국어  84
4   강은수  4월  영어  81
5   강은수  4월  수학  93
6   강은수  5월  국어  89
7   강은수  5월  영어  72
8   강은수  5월  수학  98
9   강은수  6월  국어  88
10  강은수  6월  영어  85
11  강은수  6월  수학  97
12  조재영  3월  국어  91
13  조재영  3월  영어  83
14  조재영  3월  수학  79
15  조재영  4월  국어  84
16  조재영  4월  영어  99
17  조재영  4월  수학  82
18  조재영  5월  국어  92
19  조재영  5월  영어  90
20  조재영  5월  수학  85
21  조재영  6월  국어  93
22  조재영  6월  영어  92
23  조재영  6월  수학  80

데이터프레임에서 특정 변수의 값을 살펴보기 위해서는 변수명을 대괄호 안에 넣어 준다.

In [7]:
df_exam['학생'] # '학생'이라는 변수의 모든 값

0     강은수
1     강은수
2     강은수
3     강은수
4     강은수
5     강은수
6     강은수
7     강은수
8     강은수
9     강은수
10    강은수
11    강은수
12    조재영
13    조재영
14    조재영
15    조재영
16    조재영
17    조재영
18    조재영
19    조재영
20    조재영
21    조재영
22    조재영
23    조재영
Name: 학생, dtype: object

In [8]:
df_exam[['학생', '점수']] # 두 개 이상의 변수

     학생  점수
0   강은수  80
1   강은수  75
2   강은수  90
3   강은수  84
4   강은수  81
5   강은수  93
6   강은수  89
7   강은수  72
8   강은수  98
9   강은수  88
10  강은수  85
11  강은수  97
12  조재영  91
13  조재영  83
14  조재영  79
15  조재영  84
16  조재영  99
17  조재영  82
18  조재영  92
19  조재영  90
20  조재영  85
21  조재영  93
22  조재영  92
23  조재영  80

하나의 열(`pd.Series` 자료형)은 `np.ndarray` 배열처럼 연산할 수 있다.

In [9]:
df_exam['점수'] > 85

0     False
1     False
2      True
3     False
4     False
5      True
6      True
7     False
8      True
9      True
10    False
11     True
12     True
13    False
14    False
15    False
16     True
17    False
18     True
19     True
20    False
21     True
22     True
23    False
Name: 점수, dtype: bool

방금 만든 것과 같은 불 값들의 열을 사용하여, 특정 조건을 만족하는 행만 출력할 수 있다.

예를 들어 아래 코드에서는 영어 과목의 점수가 85점을 넘는 관측만 골라서 볼 수 있다.

In [10]:
df_exam[(df_exam['과목'] == '영어') & (df_exam['점수'] > 85)] # Excel의 filter 기능과 유사.

     학생   월  과목  점수
16  조재영  4월  영어  99
19  조재영  5월  영어  90
22  조재영  6월  영어  92

점수 변수에 해당하는 값들의 평균값을 얻기 위해서는 `mean()` 메소드를 사용한다.

In [11]:
df_exam['점수'].mean() # 평균

86.75

> `df.groupby(['A'])('B').mean()`

변수 A가 범주형 데이터로 이루어져 있고 변수 B가 수치형 데이터로 이루어져 있다고 가정하자.

그러면 A의 값이 같은 것끼리 그룹을 짓고, 각 그룹에서 변수 B의 평균을 계산할 수 있다.

예를 들어 아래 코드에서는 학생별 점수 평균을 구할 수 있다.

In [12]:
# 학생별 평균
df_exam.groupby(['학생'])['점수'].mean()

학생
강은수    86.0
조재영    87.5
Name: 점수, dtype: float64

두 개 이상의 범주형 변수로 그룹화하는 것도 가능하다.

In [13]:
df_exam.groupby(['학생', '월'])['점수'].mean()
# mean 대신 max, min, sum, ...을 쓸 수 있다.

학생   월
강은수  3월    81.666667
     4월    86.000000
     5월    86.333333
     6월    90.000000
조재영  3월    84.333333
     4월    88.333333
     5월    89.000000
     6월    88.333333
Name: 점수, dtype: float64

### 데이터프레임 자료형을 만드는 두 번째 방법

1. 관측 한 개를 이루는 변수들의 이름과 값을 **딕셔너리로** 나타낸다.
2. 여러 관측들을 하나의 리스트로 묶는다.

In [14]:
students = [
    {'이름': '강은수', '학과': '국어국문학과', '전화번호': '010-1234-5678'},
    {'이름': '이한솔', '학과': '경제학부', '전화번호': '010-2345-6789'},
    {'이름': '조재영', '학과': '수리과학부', '전화번호': '010-3456-7890'},
]

df_students = pd.DataFrame(students)
df_students

    이름      학과           전화번호
0  강은수  국어국문학과  010-1234-5678
1  이한솔    경제학부  010-2345-6789
2  조재영   수리과학부  010-3456-7890

자료가 문자열로 이루어진 경우, `str` 속성을 통해 정규표현식을 활용할 수 있다.

In [15]:
df_students['전화번호_마스킹'] = df_students['전화번호'] # EDIT THIS LINE
df_students

    이름      학과           전화번호       전화번호_마스킹
0  강은수  국어국문학과  010-1234-5678  010-XXXX-5678
1  이한솔    경제학부  010-2345-6789  010-XXXX-6789
2  조재영   수리과학부  010-3456-7890  010-XXXX-7890

In [16]:
# 학생의 이름을 인덱스의 이름으로 사용하기
df_students.set_index('이름', inplace=True)
df_students

         학과           전화번호       전화번호_마스킹
이름
강은수  국어국문학과  010-1234-5678  010-XXXX-5678
이한솔    경제학부  010-2345-6789  010-XXXX-6789
조재영   수리과학부  010-3456-7890  010-XXXX-7890

In [17]:
df_students.loc['조재영']

학과                  수리과학부
전화번호        010-3456-7890
전화번호_마스킹    010-XXXX-7890
Name: 조재영, dtype: object

### 데이터프레임 자료형을 만드는 세 번째 방법

1. 변수명을 키로, 값들의 리스트를 값으로 가지는 딕셔너리를 만든다.

In [18]:
example = {
    'a': [1, 2, 3, 4, 5],
    'b': [1, 3, 5, 7, 9],
    'c': list('ABCDE')
}
pd.DataFrame(example)

   a  b  c
0  1  1  A
1  2  3  B
2  3  5  C
3  4  7  D
4  5  9  E